podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/DMA_MK82F25615.svd.xml
            <register>
               <name>ES</name>
               <description>Error Status Register\n
The ES provides information concerning the last recorded channel error</description>
               <addressOffset>0x4</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DBE</name>
                     <description>Destination Bus Error\n
Indicates that there was a bus error on a destination write</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Error</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SBE</name>
                     <description>Source Bus Error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No source bus error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The last recorded error was a bus error on a source read</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SGE</name>
                     <description>Scatter/Gather Configuration Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No scatter/gather configuration error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The last recorded error was a configuration error detected in the TCDn_DLASTSGA field. This field is checked at the beginning of a scatter/gather operation after major loop completion if TCDn_CSR[ESG] is enabled. TCDn_DLASTSGA is not on a 32 byte boundary</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NCE</name>
                     <description>NBYTES/CITER Configuration Error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No NBYTES/CITER configuration error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The last recorded error was a configuration error detected in the TCDn_NBYTES or TCDn_CITER fields. TCDn_NBYTES is not a multiple of TCDn_ATTR[SSIZE] and TCDn_ATTR[DSIZE], or TCDn_CITER[CITER] is equal to zero, or TCDn_CITER[ELINK] is not equal to TCDn_BITER[ELINK]</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DOE</name>
                     <description>Destination Offset Error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No destination offset configuration error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The last recorded error was a configuration error detected in the TCDn_DOFF field. TCDn_DOFF is inconsistent with TCDn_ATTR[DSIZE]</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DAE</name>
                     <description>Destination Address Error</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No destination address configuration error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The last recorded error was a configuration error detected in the TCDn_DADDR field. TCDn_DADDR is inconsistent with TCDn_ATTR[DSIZE]</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SOE</name>
                     <description>Source Offset Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No source offset configuration error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The last recorded error was a configuration error detected in the TCDn_SOFF field. TCDn_SOFF is inconsistent with TCDn_ATTR[SSIZE]</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SAE</name>
                     <description>Source Address Error</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No source address configuration error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The last recorded error was a configuration error detected in the TCDn_SADDR field. TCDn_SADDR is inconsistent with TCDn_ATTR[SSIZE]</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ERRCHN</name>
                     <description>Error Channel Number or Canceled Channel Number</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>CPE</name>
                     <description>Channel Priority Error</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No channel priority error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The last recorded error was a configuration error in the channel priorities within a group. Channel priorities within a group are not unique</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GPE</name>
                     <description>Group Priority Error</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No group priority error</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The last recorded error was a configuration error among the group priorities. All group priorities are not unique</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECX</name>
                     <description>Transfer Canceled</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No canceled transfers</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The last recorded entry was a canceled transfer by the error cancel transfer input</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VLD</name>
                     <description>Logical OR of all ERR status bits</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No ERR bits are set</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>At least one ERR bit is set indicating a valid error exists that has not been cleared</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ERQ</name>
               <description>Enable Request Register</description>
               <addressOffset>0xC</addressOffset>
               <fields>
                  <field>
                     <name>ERQ0</name>
                     <description>Enable DMA Request 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The DMA request signal for the corresponding channel is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The DMA request signal for the corresponding channel is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="ERQ0" > <name>ERQ1</name> <description>Enable DMA Request 1</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ2</name> <description>Enable DMA Request 2</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ3</name> <description>Enable DMA Request 3</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ4</name> <description>Enable DMA Request 4</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ5</name> <description>Enable DMA Request 5</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ6</name> <description>Enable DMA Request 6</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ7</name> <description>Enable DMA Request 7</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ8</name> <description>Enable DMA Request 8</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ9</name> <description>Enable DMA Request 9</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ10</name> <description>Enable DMA Request 10</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ11</name> <description>Enable DMA Request 11</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ12</name> <description>Enable DMA Request 12</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ13</name> <description>Enable DMA Request 13</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ14</name> <description>Enable DMA Request 14</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ15</name> <description>Enable DMA Request 15</description> <bitOffset>15</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ16</name> <description>Enable DMA Request 16</description> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ17</name> <description>Enable DMA Request 17</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ18</name> <description>Enable DMA Request 18</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ19</name> <description>Enable DMA Request 19</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ20</name> <description>Enable DMA Request 20</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ21</name> <description>Enable DMA Request 21</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ22</name> <description>Enable DMA Request 22</description> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ23</name> <description>Enable DMA Request 23</description> <bitOffset>23</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ24</name> <description>Enable DMA Request 24</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ25</name> <description>Enable DMA Request 25</description> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ26</name> <description>Enable DMA Request 26</description> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ27</name> <description>Enable DMA Request 27</description> <bitOffset>27</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ28</name> <description>Enable DMA Request 28</description> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ29</name> <description>Enable DMA Request 29</description> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ30</name> <description>Enable DMA Request 30</description> <bitOffset>30</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ31</name> <description>Enable DMA Request 31</description> <bitOffset>31</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>EEI</name>
               <description>Enable Error Interrupt Register\n
Contains a bit to enable or disable errors interrupts from each channel</description>
               <addressOffset>0x14</addressOffset>
               <fields>
                  <field>
                     <name>EEI0</name>
                     <description>Enable Error Interrupt 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Interrupts disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Interrupts enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="EEI0" > <name>EEI1</name> <description>Enable Error Interrupt 1</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI2</name> <description>Enable Error Interrupt 2</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI3</name> <description>Enable Error Interrupt 3</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI4</name> <description>Enable Error Interrupt 4</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI5</name> <description>Enable Error Interrupt 5</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI6</name> <description>Enable Error Interrupt 6</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI7</name> <description>Enable Error Interrupt 7</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI8</name> <description>Enable Error Interrupt 8</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI9</name> <description>Enable Error Interrupt 9</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI10</name> <description>Enable Error Interrupt 10</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI11</name> <description>Enable Error Interrupt 11</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI12</name> <description>Enable Error Interrupt 12</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI13</name> <description>Enable Error Interrupt 13</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI14</name> <description>Enable Error Interrupt 14</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI15</name> <description>Enable Error Interrupt 15</description> <bitOffset>15</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI16</name> <description>Enable Error Interrupt 16</description> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI17</name> <description>Enable Error Interrupt 17</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI18</name> <description>Enable Error Interrupt 18</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI19</name> <description>Enable Error Interrupt 19</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI20</name> <description>Enable Error Interrupt 20</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI21</name> <description>Enable Error Interrupt 21</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI22</name> <description>Enable Error Interrupt 22</description> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI23</name> <description>Enable Error Interrupt 23</description> <bitOffset>23</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI24</name> <description>Enable Error Interrupt 24</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI25</name> <description>Enable Error Interrupt 25</description> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI26</name> <description>Enable Error Interrupt 26</description> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI27</name> <description>Enable Error Interrupt 27</description> <bitOffset>27</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI28</name> <description>Enable Error Interrupt 28</description> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI29</name> <description>Enable Error Interrupt 29</description> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI30</name> <description>Enable Error Interrupt 30</description> <bitOffset>30</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI31</name> <description>Enable Error Interrupt 31</description> <bitOffset>31</bitOffset> </field>
               </fields>
            </register>
