podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/DMA_MK82F25615.svd.xml
            <register>
               <name>INT</name>
               <description>Interrupt Request Register</description>
               <addressOffset>0x24</addressOffset>
               <fields>
                  <field>
                     <name>INT0</name>
                     <description>Interrupt Request 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The interrupt request for corresponding channel is cleared</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The interrupt request for corresponding channel is active</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="INT0" > <name>INT1</name> <description>Interrupt Request 1</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT2</name> <description>Interrupt Request 2</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT3</name> <description>Interrupt Request 3</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT4</name> <description>Interrupt Request 4</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT5</name> <description>Interrupt Request 5</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT6</name> <description>Interrupt Request 6</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT7</name> <description>Interrupt Request 7</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT8</name> <description>Interrupt Request 8</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT9</name> <description>Interrupt Request 9</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT10</name> <description>Interrupt Request 10</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT11</name> <description>Interrupt Request 11</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT12</name> <description>Interrupt Request 12</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT13</name> <description>Interrupt Request 13</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT14</name> <description>Interrupt Request 14</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT15</name> <description>Interrupt Request 15</description> <bitOffset>15</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT16</name> <description>Interrupt Request 16</description> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT17</name> <description>Interrupt Request 17</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT18</name> <description>Interrupt Request 18</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT19</name> <description>Interrupt Request 19</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT20</name> <description>Interrupt Request 20</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT21</name> <description>Interrupt Request 21</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT22</name> <description>Interrupt Request 22</description> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT23</name> <description>Interrupt Request 23</description> <bitOffset>23</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT24</name> <description>Interrupt Request 24</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT25</name> <description>Interrupt Request 25</description> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT26</name> <description>Interrupt Request 26</description> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT27</name> <description>Interrupt Request 27</description> <bitOffset>27</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT28</name> <description>Interrupt Request 28</description> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT29</name> <description>Interrupt Request 29</description> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT30</name> <description>Interrupt Request 30</description> <bitOffset>30</bitOffset> </field>
                  <field derivedFrom="INT0" > <name>INT31</name> <description>Interrupt Request 31</description> <bitOffset>31</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>ERR</name>
               <description>Error Register</description>
               <addressOffset>0x2C</addressOffset>
               <fields>
                  <field>
                     <name>ERR0</name>
                     <description>Error In Channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>An error in this channel has not occurred</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>An error in this channel has occurred</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="ERR0" > <name>ERR1</name> <description>Error In Channel 1</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR2</name> <description>Error In Channel 2</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR3</name> <description>Error In Channel 3</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR4</name> <description>Error In Channel 4</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR5</name> <description>Error In Channel 5</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR6</name> <description>Error In Channel 6</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR7</name> <description>Error In Channel 7</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR8</name> <description>Error In Channel 8</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR9</name> <description>Error In Channel 9</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR10</name> <description>Error In Channel 10</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR11</name> <description>Error In Channel 11</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR12</name> <description>Error In Channel 12</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR13</name> <description>Error In Channel 13</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR14</name> <description>Error In Channel 14</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR15</name> <description>Error In Channel 15</description> <bitOffset>15</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR16</name> <description>Error In Channel 16</description> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR17</name> <description>Error In Channel 17</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR18</name> <description>Error In Channel 18</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR19</name> <description>Error In Channel 19</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR20</name> <description>Error In Channel 20</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR21</name> <description>Error In Channel 21</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR22</name> <description>Error In Channel 22</description> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR23</name> <description>Error In Channel 23</description> <bitOffset>23</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR24</name> <description>Error In Channel 24</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR25</name> <description>Error In Channel 25</description> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR26</name> <description>Error In Channel 26</description> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR27</name> <description>Error In Channel 27</description> <bitOffset>27</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR28</name> <description>Error In Channel 28</description> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR29</name> <description>Error In Channel 29</description> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR30</name> <description>Error In Channel 30</description> <bitOffset>30</bitOffset> </field>
                  <field derivedFrom="ERR0" > <name>ERR31</name> <description>Error In Channel 31</description> <bitOffset>31</bitOffset> </field>
               </fields>
            </register>
